WebLookmaxing/load-test-basic.yml
config:
  target: 'http://localhost:3001'
  phases:
    # Fase 1: Ramp up gradual (usuarios normales)
    - duration: 120
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up load"

    # Fase 2: Carga sostenida
    - duration: 300
      arrivalRate: 20
      name: "Sustained load"

    # Fase 3: Pico de carga
    - duration: 60
      arrivalRate: 50
      name: "Peak load"

    # Fase 4: Ramp down
    - duration: 60
      arrivalRate: 20
      rampTo: 0
      name: "Ramp down"

  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  # Flujos de usuario autenticado
  - name: "Authenticated user flow"
    weight: 60
    flow:
      # 1. Login
      - post:
          url: "/api/auth/login"
          json:
            email: "test{{ $randomInt(1, 1000) }}@example.com"
            password: "password123"
          capture:
            json: "$.data.token"
            as: "authToken"

      # 2. Ver productos (con autenticación)
      - get:
          url: "/api/products"
          headers:
            Authorization: "Bearer {{ authToken }}"

      # 3. Crear orden
      - post:
          url: "/api/orders"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            products:
              - productId: "507f1f77bcf86cd799439011"
                quantity: 1
            shippingAddress:
              street: "Test Street"
              city: "Test City"
              country: "Test Country"
              zipCode: "12345"
            paymentMethod: "paypal"

  # Flujos de usuario no autenticado
  - name: "Public user flow"
    weight: 30
    flow:
      # 1. Ver productos públicos
      - get:
          url: "/api/products"

      # 2. Ver detalles de producto
      - get:
          url: "/api/products/507f1f77bcf86cd799439011"

      # 3. Registro de nuevo usuario
      - post:
          url: "/api/auth/register"
          json:
            email: "newuser{{ $randomInt(1000, 9999) }}@example.com"
            password: "password123"
            firstName: "User{{ $randomInt(1, 1000) }}"
            lastName: "Test"
            phone: "+573001234567"

  # Flujos de WhatsApp
  - name: "WhatsApp integration flow"
    weight: 10
    flow:
      # 1. Enviar mensaje de WhatsApp
      - post:
          url: "/api/whatsapp/templates/welcome"
          json:
            to: "+573001234567"
            customerName: "TestUser{{ $randomInt(1, 1000) }}"