WebLookmaxing/load-test-errors.yml
# Archivo de configuración de Artillery para pruebas específicas de errores
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Error injection test"

scenarios:
  # Tests de errores específicos
  - name: "Invalid authentication"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "invalid@test.com"
            password: "wrong"
          expect:
            - statusCode: 401

  - name: "Missing required fields"
    weight: 25
    flow:
      - post:
          url: "/api/auth/register"
          json:
            email: "test@test.com"
            # Missing password and other fields
          expect:
            - statusCode: 400

  - name: "Invalid phone number format"
    weight: 20
    flow:
      - post:
          url: "/api/whatsapp/send"
          json:
            to: "invalid-phone"
            message: "Test message"
          expect:
            - statusCode: 400

  - name: "Database connection timeout"
    weight: 15
    flow:
      # Este test verifica manejo de timeouts
      - get:
          url: "/api/products?limit=10000" # Consulta que podría causar timeout
          timeout: 1000  # Timeout muy corto
          expect:
            - statusCode: [200, 500, 504]

  - name: "Rate limiting test"
    weight: 10
    flow:
      # Múltiples requests rápidos para activar rate limiting
      - loop:
          - get:
              url: "/api/products"
            - think: 0.1  # 100ms entre requests
        count: 200  # Más del límite de rate limiting